#=======================================================================================
# TEST_03_color.py
#=======================================================================================

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------
import os
import sys

# Для того, чтобы код, написанный с помощью внутренних средств Python 3 или с помощью библиотеки termcolor заработал в Windows 10, надо включить поддержку ANSI для stdout в запущенной консоле.
# Сделать это можно следующим образом:
import ctypes
kernel32 = ctypes.windll.kernel32
kernel32.SetConsoleMode(kernel32.GetStdHandle(-11), 7)

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------
import argparse
import datetime

# Вывод цветного текста в консоль с colorama
# Colorama — самая популярная библиотека для вывода цветного текста на Python 3.
# Colorama позволяет использовать ANSI коды не только в Linux, но и в Windows.
# Использование функций и методов библиотеки упрощает написание кода и делает более
# простым для поддержки. Больше не нужно запоминать или копировать ANSI коды.
# Команды настолько просты и интуитивно понятны, что с задачей справиться даже обычный пользователь.
# Использование сторонней библиотеки, такой как colorama,
# не приводит к каким-то негативным эффектам. Перед использованием библиотеки colorama,
# её следует установить с помощью команды в консоле pip install colorama.

# Стоит обратить внимание на функцию init. Если её забыть запустить,
# то не будет поддерживаться вывод на Windows 10.

import colorama
from colorama import Fore, Back, Style

# Цветной текст с помощью termcolor
# Эта библиотека даёт программисту исчерпывающий инструментарий для работы с цветом текста.
# Часто termcolor используют вместе с colorama. Termcolor используют непосредственно для написания кода,
# действительно, её синтаксис более удобный и простой.

from termcolor import colored, cprint

#------------------------------------------
# БИБЛИОТЕКА LU
#------------------------------------------
import LUConst
import LUStrings
import LUSupport
#------------------------------------------

#------------------------------------------
# CONST
#------------------------------------------
sBEGIN_hex = '\x1b['
sBEGIN_Unicode = '\u001b'
sBEGIN_oct = '\33['
sEND = 'm'
sTEST = 'ТЕСТ'
sReset = sBEGIN_oct+'0'+';'+sEND        #вернуться к начальному стилю
#--------------------------------------
# 8 основных цветов и стили
#--------------------------------------
# Изменения стиля
# 1 Жирный
sBOLD = '01'
# 2 Блеклый
# 3 Курсив
sITALIC = '01'
# 4 Подчёркнутый
sUNDERLINE = '01'
# 5 Мигание
# 7 Реверс
sREVERSE = '07'
# 9 Зачёркнутый

#--------------------------------------
# Изменения цвета шрифта
#--------------------------------------
# 30    Чёрный
# 31    Красный
# 32    Зелёный
# 33    Жёлтый
# 34    Синий
# 35    Фиолетовый
# 36    Бирюзовый
# 37    Белый

#--------------------------------------
# Изменения цвета фона
#--------------------------------------
# 40    Чёрный
# 41    Красный
# 42    Зелёный
# 43    Жёлтый
# 44    Синий
# 45    Фиолетовый
# 46    Бирюзовый
# 47    Белый
#--------------------------------------

#--------------------------------------
#Больше цветов: аж целых 256
#--------------------------------------
#--------------------------------------
# Изменения цвета шрифта
#--------------------------------------
# 38

#--------------------------------------
# Изменения цвета фона
#--------------------------------------
# 48

#--------------------------------------
# Совсем много цветов
# Этот формат не всегда поддерживается стандартными консолями.
#--------------------------------------

# Некотрые будут негодовать: "256 цветов и нет моего любимого терракотового, какой ужас!". Для таких ценителей существует формат, который уже поддерживает 24 битные цвета (3 канала RGB по 256 градаций).
# Для не ценителей поясню, что терракотовый кодируется как — (201, 100, 59) или #c9643b.
# Синтаксис в этом формате выглядит вот так:

# цвет текста
# \33[+38;2;⟨r⟩;⟨g⟩;⟨b⟩ m
# цвет фона
# \33[+48;2;⟨r⟩;⟨g⟩;⟨b⟩ m

#--------------------------------------
# Избранные цвета 8
#--------------------------------------
sFG8_01 = '37'
sBG8_01 = '40'
sColor8_01 = sBEGIN_oct+sBOLD+';'+sFG8_01+';'+sBG8_01+sEND

#--------------------------------------
# Избранные цвета 256
#--------------------------------------
sFG256_01 = '38;05;'+'15'
sBG256_01 = '48;05;'+'21'
sColor256_01 = sBEGIN_oct+sBOLD+';'+sFG256_01+';'+sBG256_01+sEND
#--------------------------------------

print ('os.name->', os.name)  # ответ: nt
print ("os.environ['PYTHONPATH']->", os.environ ['PYTHONPATH'])
print ("sys.path->", sys.path)
#------------------------------------------
# Разбор аргументов
#------------------------------------------
parser = argparse.ArgumentParser(description='Параметры')
parser.add_argument('-P1', type=str, nargs='?', default='', dest='P1', help='P1')
args = parser.parse_args()
print('-P1 = ',args.P1)
#------------------------------------------
P1 = ''
if args.P1 != '':
    P1 = args.P1
#endif
#------------------------------------------

def print_with_color (s, color = Fore.WHITE, brightness = Style.NORMAL, **kwargs):
    """Служебная функция, обертывающая обычную функцию "печать()"
    , но с цветами и яркостью"""
    #print (f"", **kwargs)
    print (color+brightness+s)

#-------------------------------------------------------------------------------
# TEST_03_01_colorama ():
#-------------------------------------------------------------------------------
def TEST_03_01_colorama ():
#beginfunction
    print ('=============================')
    print ('TEST_03_02_colorama. Часть 1.')
    print ('=============================')
    colorama.init()
    print(Fore.RED + 'Красный текст')
    print(Back.BLUE + 'Синий фон')
    print(Style.RESET_ALL)
    print('Снова обычный текст')

    print ('=============================')
    print ('TEST_03_02_colorama. Часть 2.')
    print ('=============================')
    # список доступных фронтальных цветов
    FOREGROUND = [ Fore.BLACK, Fore.RED, Fore.GREEN, Fore.YELLOW, Fore.BLUE, Fore.MAGENTA, Fore.CYAN, Fore.WHITE ]
    # список доступных фоновых цветов
    BACKGROUND = [ Back.BLACK, Back.RED, Back.GREEN, Back.YELLOW, Back.BLUE, Back.MAGENTA, Back.CYAN, Back.WHITE ]
    BRIGHTNESS = [ Style.DIM, Style.NORMAL, Style.BRIGHT ]

    for fore in FOREGROUND:
        for brightness in BRIGHTNESS:
            print_with_color('Myrusakov!', color=fore, brightness=brightness)

    #Теперь используем фоновые цвета:
    for fore in FOREGROUND:
        for back in BACKGROUND:
            for brightness in BRIGHTNESS:
                print_with_color ("Myrusakov", color = back + fore, brightness = brightness, end = ' ')
    print ()

#endfunction

#-------------------------------------------------------------------------------
# TEST_03_02_termcolor ():
#-------------------------------------------------------------------------------
def TEST_03_02_termcolor ():
#beginfunction
    print ('=============================')
    print ('TEST_03_02_termcolor')
    print ('=============================')
    print (colored('Привет мир!', 'red', attrs=['underline']))
    print ('Привет, я люблю тебя!')
    cprint('Вывод с помощью cprint', 'green', 'on_blue')
#endfunction

def colors_16(color_):
    return("\033[2;{num}m {num} \033[0;0m".format(num=str(color_)))

def colors_256(color_):
    num1 = str(color_)
    num2 = str(color_).ljust(3, ' ')
    if color_ % 16 == 0:
        return(f"\033[38;5;{num1}m {num2} \033[0;0m\n")
    else:
        return(f"\033[38;5;{num1}m {num2} \033[0;0m")

#-------------------------------------------------------------------------------
# TEST_03_03 ():
#-------------------------------------------------------------------------------
def TEST_03_03 ():
#beginfunction
    print ('=============================')
    print ('TEST_03_03')
    print ('=============================')
    print ("The 16 colors scheme is:")
    print (' '.join ([colors_16 (x) for x in range (30, 38)]))
    print ("\nThe 256 colors scheme is:")
    print (' '.join ([colors_256 (x) for x in range (256)]))
#endfunction

#-------------------------------------------------------------------------------
# TEST_03_03 ():
#-------------------------------------------------------------------------------
def TEST_03_04 ():
#beginfunction
    print ('=============================')
    print ('TEST_03_04')
    print ('=============================')

    s = LUStrings.AddCharR('.', 'dddddd', 40)
    print (s)
    s = LUStrings.AddChar('.', 'dddddd', 40)
    print (s)
    #Часто используемые сочетания (copy-paste-able)
    #Остановить печать цветов
    s = 'Остановить печать цветов'+'\033[0;0m'
    #print(s)

    s = sBEGIN_oct+'31'+sEND + sTEST+sReset          #красный текст — для обозначения ошибок
    print(s)
    s = sBEGIN_oct+'1'+';'+'31'+sEND + sTEST+sReset  #жирный красный текст — для обозначения критических ошибок
    print(s)
    s = sBEGIN_oct+'32'+sEND + sTEST+sReset          #зеленый текст — успешное выполнение
    print(s)
    s = sBEGIN_oct+'3'+';'+'31'+sEND + sTEST+sReset  #красный курсив — текст ошибки
    print(s)
    s = sBEGIN_oct+'43'+sEND + sTEST+sReset          #выделение основного, как будто жёлтым маркером
    print (s)
    s = sColor256_01 + sTEST+sReset
    print (s)
#endfunction

#------------------------------------------
# main():
#------------------------------------------
def main():
#beginfunction
    #TEST_03_01_colorama()
    #TEST_03_02_termcolor()
    #TEST_03_03()
    TEST_03_04()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
